## Numpy

In [12]:
import numpy

In [13]:
my_arr = numpy.array([1,2,3])
my_arr

array([1, 2, 3])

In [14]:
type(my_list)

NameError: name 'my_list' is not defined

In [ ]:
type(my_arr)

numpy.ndarray

In [ ]:
my_list * 2

[1, 2, 3, 1, 2, 3]

In [ ]:
my_arr * 2

array([2, 4, 6])

In [ ]:
my_coerced_array = numpy.array([1,23,3,'test'])
my_coerced_array

array(['1', '23', '3', 'test'], dtype='<U11')

In [ ]:
import numpy as np

In [ ]:
np.sqrt(my_arr)

array([1.        , 1.41421356, 1.73205081])

In [ ]:
my_arr[1]

2

In [ ]:
arr = np.array ([1,2,3], dtype=np.int32)
arr.dtype

dtype('int32')

In [ ]:
new_array =([0,1,2,3,4])
new_array[0:1]

[0]

In [ ]:
new_array[0:2]

[0, 1]

In [ ]:
new_array[0:3]

[0, 1, 2]

In [ ]:
new_array[1:3]

[1, 2]

## Pandas DF & Seaborn

In [ ]:

import pandas as pd
import numpy as np

In [ ]:
record1 = np.array(['Jack', 182, False])
record2 = np.array(['Susie',150,False])
record3 = np.array(['Zbigniew',160,True])
df = pd.DataFrame(data = [record1,record2, record3], columns=['name','height','flag'])
df

       name height   flag
0      Jack    182  False
1     Susie    150  False
2  Zbigniew    160   True

In [15]:
import seaborn as sns
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [25]:
birds = sns.load_dataset('penguins')
birds.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

## OS import data

In [27]:
import os
os.path.isfile('11.csv')

True

In [28]:
os.path.isfile('fake.csv')

False

In [30]:
excel = pd.read_excel('11.xlsx')
excel.head()

   id  imie  nazwisko
0   1   Jan  Kowalski
1   2  Anna  Kowalski
2   3   Jan  Kowalski
3   4  Anna  Kowalski
4   5   Jan  Kowalski

In [56]:
 !wsl cat 11.csv

id,book,author
1,Oracle SQL,Steve
2,Oracle SQL v2,Steve

In [ ]:
csvComma = pd.read_csv('11.csv')
csvComma.head()

   1     Oracle SQL  Steve
0  2  Oracle SQL v2  Steve

In [37]:
csv = pd.read_csv('11v2.csv',sep='|')
csv.head()

   id           book author
0   1     Oracle SQL  Steve
1   2  Oracle SQL v2  Steve

In [43]:
csvNoHeader = pd.read_csv('11noHeader.csv')
csvNoHeader

   1     Oracle SQL  Steve
0  2  Oracle SQL v2  Steve

In [59]:
 !wsl cat 11noHeader.csv

1,Oracle SQL,Steve
2,Oracle SQL v2,Steve

In [60]:
csvNoHeader = pd.read_csv('11noHeader.csv',header=None)
csvNoHeader

   0              1      2
0  1     Oracle SQL  Steve
1  2  Oracle SQL v2  Steve

## Data frame exploring

In [62]:
birds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [63]:
birds.describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      342.000000     342.000000         342.000000   342.000000
mean        43.921930      17.151170         200.915205  4201.754386
std          5.459584       1.974793          14.061714   801.954536
min         32.100000      13.100000         172.000000  2700.000000
25%         39.225000      15.600000         190.000000  3550.000000
50%         44.450000      17.300000         197.000000  4050.000000
75%         48.500000      18.700000         213.000000  4750.000000
max         59.600000      21.500000         231.000000  6300.000000

In [65]:
birds.describe(include='all')

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
count,344,344,342.000000,342.000000,342.000000,342.000000,333
unique,3,3,NaN,NaN,NaN,NaN,2
top,Adelie,Biscoe,NaN,NaN,NaN,NaN,Male
freq,152,168,NaN,NaN,NaN,NaN,168
mean,NaN,NaN,43.921930,17.151170,200.915205,4201.754386,NaN
std,NaN,NaN,5.459584,1.974793,14.061714,801.954536,NaN
min,NaN,NaN,32.100000,13.100000,172.000000,2700.000000,NaN
25%,NaN,NaN,39.225000,15.600000,190.000000,3550.000000,NaN
50%,NaN,NaN,44.450000,17.300000,197.000000,4050.000000,NaN
75%,NaN,NaN,48.500000,18.700000,213.000000,4750.000000,NaN
max,NaN,NaN,59.600000,21.500000,231.000000,6300.000000,NaN

In [68]:
birds.head(1)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male

In [ ]:
print('iloc = integer location')
print('row , column')
birds.iloc[0,0]

iloc = integer location
row , column

'Adelie'

In [79]:
birds.iloc[0,1]

'Torgersen'

In [85]:
birds.iloc[0:2]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female

In [88]:
birds.iloc[1:3]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female

In [92]:
birds.iloc[0:1,0:3]

  species     island  bill_length_mm
0  Adelie  Torgersen            39.1